<?php

// ****************************************************************************************************************** //
// ****************************************************************************************************************** //
// ****************************************************************************************************************** //
// ************************************************ FUNCIONES EXTRAS ************************************************ //
// ****************************************************************************************************************** //
// ****************************************************************************************************************** //
// ****************************************************************************************************************** //


    /*--------------------------------------------------------------------------------/
      FUNCIÓN FILTRADO: Se encarga de eliminar espacio y después de los datos, los \ y 
      de traducir los caracteres especiales en entidades HTML.
    /--------------------------------------------------------------------------------*/

    function filtrado($datos)
    {
            $datos = trim($datos);                  // Elimina espacios antes y después de los datos
            $datos = stripslashes($datos);          // Elimina backslashes \ 
            $datos = htmlspecialchars($datos);      // Traduce caracteres especiales en entidades HTML
            return $datos;
    }

    /*--------------------------------------------------------------------------------/
      FUNCIÓN ACTUALIZA DNI: Actualiza el DNI con los 8 caracteres númericos y la letra en MAYÚSCULA.
    /--------------------------------------------------------------------------------*/
    
    function actualizaDNI($dni)
    {

        $dniNumeros = substr($dni,0,8);                         // Recoge los 8 números
        $dniLetra   = strtoupper(substr($dni,8));               // Transforma 
        $dni        = strval($dniNumeros).$dniLetra;

        return $dni;
    }



?>